Revit 2027 API
RebarBarType.CreateDefaultRebarBarType Method
 Creates a new RebarBarType object with a default name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId CreateDefaultRebarBarType(
	Document ADoc
)
Public Shared Function CreateDefaultRebarBarType (
	ADoc As Document
) As ElementId
public:
static ElementId^ CreateDefaultRebarBarType(
	Document^ ADoc
)
static member CreateDefaultRebarBarType :
        ADoc : Document -> ElementId
Parameters
ADoc Document
 The document.
Return Value
ElementId
 The newly created type id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace